views/user/_form.php

SELECT * FROM `viloyat`
SELECT * FROM `tuman`
---

                                    <?= $form->field($model, 'username')->textInput(['maxlength' => true]) ?>

                                    <?= $form->field($model, 'viloyat_id')->dropDownList(
                                        ArrayHelper::map(Viloyat::find()->all(), 'viloyat_id', 'viloyat_nomi'),
                                        [
                                            'prompt' => 'Viloyatni tanlang',
                                            'onchange' => '
                                                        $.post("/tuman/list/' . '"+$(this).val(), function( data ){
                                                            $("select#user-tuman_id").html( data );
                                                        });'
                                        ]
                                    )->label('Viloyati') ?>

                                    <?= $form->field($model, 'tuman_id')->dropDownList(
                                        ArrayHelper::map(Tuman::find()->all(), 'tuman_id', 'tuman_nomi'),
                                        [
                                            'prompt' => 'Tumanni tanlang',
                                        ]
                                    )->label('Tumani') ?>

SELECT * FROM `kasblar`
---

                                    <?= $form->field($model, 'password_hash')->textInput(['maxlength' => true]) ?>

                                    <?= $form->field($model, 'role')->dropDownList(
                                                        ArrayHelper::map(Kasblar::find()->all(),'nomi','nomi'),
                                                        [
                                                            'prompt'=>'Rol tanlang'
                                                        ]
                                                    ) ?>