controllers/BemorController.php

SELECT * FROM `bemor` WHERE `id`='1'
---
    public function actionChart($id)
    {
        $model = Bemor::findOne($id);

SELECT * FROM `bemor` WHERE `id`=13
SELECT * FROM `bemor` WHERE `id`=30
---
    public function actionTashxis($id){
        $id_1 = 1;
        $id_2 = 2;
        $id_3 = 4;
        $segnal_id1 = Bemor::findOne($id_1);
        $segnal_id2 = Bemor::findOne($id_2);
        $segnal_id3 = Bemor::findOne($id_3);
        return $this->render('tashxis', [
            'model' => $this->findModel($id),
            'segnal_id1'=>$segnal_id1,
            'segnal_id2'=>$segnal_id2,
            'segnal_id3'=>$segnal_id3,
        ]);

SELECT * FROM `bemor`
---
    public function actionCreate()
    {
        $model = new Bemor();

       if ($model->load(Yii::$app->request->post())) {

SELECT * FROM `bemor` WHERE `id`='41'
---
    protected function findModel($id)
    {
        if (($model = Bemor::findOne($id)) !== null) {