views/blocks/frontend/header.php

SELECT COUNT(*) FROM `korzinka` LEFT JOIN `orders` ON korzinka.order_id = orders.id WHERE (korzinka.user_id = 4) and ((order_id is null) or (orders.state != 2))
---

            <a <?=Yii::$app->user->isGuest ? "href='javascript:void(0)'  data-toggle='modal' data-target='#ms-account-modal'" : "href='".Url::to('/site/card')."'"?>
               class="btn-ms-menu btn-circle btn-circle-primary  animated zoomInDown animation-delay-10">
                <i class="zmdi zmdi-shopping-cart-plus"><sup style="top: -80%;" id="korzinka_count"><?=Yii::$app->user->isGuest ? 0 : \app\models\Korzinka::find()->join('LEFT JOIN', 'orders', 'korzinka.order_id = orders.id')
                            ->where("(korzinka.user_id = ".Yii::$app->user->id.") and ((order_id is null) or (orders.state != 2))")->count()?></sup></i>