views/site/index.php

          <p class="lead uppercase">Ushbu psixologik metodikalar haqida batafsil</p>
        </div>
        <div class="row">
          <? $topmetodika = Mahsulot::find()->where(['index_uchun'=>1])->limit(3)->all();
---
SELECT * FROM `mahsulot` WHERE `index_uchun`=1 LIMIT 3

              <div class="carousel-caption">
                <div class="container">
                  <div class="row">
                    <? $i=0; foreach (Fikrlar::find()->where(['status'=>1])->all() as $fikr) { if($i==3){$i=0;?>
---
SELECT * FROM `fikrlar` WHERE `status`=1

        <h2 class="text-center color-primary mb-4">Yangiliklar</h2>
        <div class="owl-dots"></div>
        <div class="owl-carousel owl-theme">
          <? $i=0; foreach (Sahifalar::find()->where(['status'=>1])->all() as $model): $i++;
---
SELECT * FROM `sahifalar` WHERE `status`=1