views/bemor/_form.php

SELECT * FROM `viloyat`
SELECT * FROM `tuman`
---
                                </div>
                                <div class="col-12 col-sm-6">

                                    <?= $form->field($model, 'viloyat_id')->dropDownList(
                                        ArrayHelper::map(Viloyat::find()->all(), 'viloyat_id', 'viloyat_nomi'),
                                        [
                                            'prompt' => 'Viloyatni tanlang',
                                            'onchange' => '
                                                        $.post("/tuman/list/' . '"+$(this).val(), function( data ){
                                                            $("select#user-tuman_id").html( data );
                                                        });'
                                        ]
                                    )->label('Viloyati') ?>

                                    <?= $form->field($model, 'tuman_id')->dropDownList(
                                        ArrayHelper::map(Tuman::find()->all(), 'tuman_id', 'tuman_nomi'),
                                        [
                                            'prompt' => 'Tumanni tanlang',
                                        ]
                                    )->label('Tumani') ?>