views/bemor/index.php

SELECT * FROM `bemor`
SELECT * FROM `bemor` WHERE `jinsi`='erkak'
SELECT * FROM `bemor` WHERE `jinsi`='ayol'
SELECT * FROM `bemor` WHERE `viloyat_id`='1'
SELECT * FROM `bemor` WHERE `viloyat_id`='2'
SELECT * FROM `bemor` WHERE `viloyat_id`='3'
SELECT * FROM `bemor` WHERE `viloyat_id`='4'
SELECT * FROM `bemor` WHERE `viloyat_id`='5'
SELECT * FROM `bemor` WHERE `viloyat_id`='6'
SELECT * FROM `bemor` WHERE `viloyat_id`='7'
SELECT * FROM `bemor` WHERE `viloyat_id`='8'
SELECT * FROM `bemor` WHERE `viloyat_id`='9'
SELECT * FROM `bemor` WHERE `viloyat_id`='10'
SELECT * FROM `bemor` WHERE `viloyat_id`='11'
SELECT * FROM `bemor` WHERE `viloyat_id`='12'
SELECT * FROM `bemor` WHERE `viloyat_id`='13'
SELECT * FROM `bemor` WHERE `viloyat_id`='14'
---
use yii\widgets\DetailView;
use yii\bootstrap\Modal;
use app\models\Tavsiya;
$abs= app\models\Bemor::find()->all();
$jamoa = \app\models\Bemor::find()->all();
$jamoasoni=count($jamoa);
$erk = \app\models\Bemor::find()->where(['jinsi'=>'erkak'])->all();
$erk_soni=count($erk);
$ayol = \app\models\Bemor::find()->where(['jinsi'=>'ayol'])->all();
$ayol_soni=count($ayol);
// viloyatlar
$qoraqal = \app\models\Bemor::find()->where(['viloyat_id'=>'1'])->all();
$qoraqal_soni=count($qoraqal);
$andijon = \app\models\Bemor::find()->where(['viloyat_id'=>'2'])->all();
$andijon_soni=count($andijon);
$buxoro = \app\models\Bemor::find()->where(['viloyat_id'=>'3'])->all();
$buxoro_soni=count($buxoro);
$jizzax = \app\models\Bemor::find()->where(['viloyat_id'=>'4'])->all();
$jizzax_soni=count($jizzax);
$qashqadaryo = \app\models\Bemor::find()->where(['viloyat_id'=>'5'])->all();
$qashqadaryo_soni=count($qashqadaryo);
$navoiy = \app\models\Bemor::find()->where(['viloyat_id'=>'6'])->all();
$navoiy_soni=count($navoiy);
$namangan = \app\models\Bemor::find()->where(['viloyat_id'=>'7'])->all();
$namangan_soni=count($namangan);
$samarqand = \app\models\Bemor::find()->where(['viloyat_id'=>'8'])->all();
$samarqand_soni=count($samarqand);
$surxon = \app\models\Bemor::find()->where(['viloyat_id'=>'9'])->all();
$surxon_soni=count($surxon);
$sirdaryo = \app\models\Bemor::find()->where(['viloyat_id'=>'10'])->all();
$sirdaryo_soni=count($sirdaryo);
$toshkent = \app\models\Bemor::find()->where(['viloyat_id'=>'11'])->all();
$toshkent_soni=count($toshkent);
$fargona = \app\models\Bemor::find()->where(['viloyat_id'=>'12'])->all();
$fargona_soni=count($fargona);
$xaoazm = \app\models\Bemor::find()->where(['viloyat_id'=>'13'])->all();
$xaoazm_soni=count($xaoazm);
$tosh_shahri = \app\models\Bemor::find()->where(['viloyat_id'=>'14'])->all();