models/Kasblar.php

SELECT * FROM `kasblar` WHERE `status`=1
---
    public static function getKasblarList()
    {
        $result = self::find()->where(['status'=>self::STATUS_ACTIVE])->all();