models/Viloyat.php

    public static function getRegionsList()
    {
        $result = self::find()->where(['status'=>self::STATUS_ACTIVE])->all();
---
SELECT * FROM `viloyat` WHERE `status`=1